app/views/home/index.html.erb

SELECT COUNT(*) FROM `services`  WHERE `services`.`user_id` = 1
SELECT  `services`.* FROM `services`  WHERE `services`.`user_id` = 1 AND `services`.`service_name` = 'gdrive'  ORDER BY `services`.`id` ASC LIMIT 1
---
<% if user_signed_in? %>
  <% if current_user.services.count == 2 %>
    <% @Gservice = current_user.services.where( :service_name => 'gdrive').first()  %>