app/controllers/services_controller.rb

INSERT INTO `services` (`created_at`, `folder_id`, `service_id`, `service_name`, `updated_at`, `user_id`) VALUES ('2016-08-02 08:30:54', 'FTNrQKakw7Sy6YHZBZzCgsUXMh3Ud2ScL4MrgkAFJhds=', '50554005', 'dropbox', '2016-08-02 08:30:54', 1)
---
  def create
  	Service.create(:user_id => params[:user_id], :service_id => params[:service_id], :service_name => params[:service_name] ,:folder_id => params[:folder_id])