app/controllers/uploads_controller.rb

  def create
    Upload.create(:user_id => params[:user_id], :gservice => params[:gservice], :dservice => params[:dservice], :gfid => params[:gfid], :dfid => params[:dfid] ,:fname => params[:fname], :mimetype => params[:mimetype])
---
INSERT INTO `uploads` (`created_at`, `dfid`, `dservice`, `fname`, `gfid`, `gservice`, `mimetype`, `updated_at`, `user_id`) VALUES ('2016-08-02 08:32:55', 'FTNrQKakw7Sy6YHZBZzCgsYA6yCzVYMPoveRdBbbicu8=', '50554005', 'Screenshot from 2016-08-02 15-55-56.png', 'FTSea5ypPgZyUUppx4rEmYZtqOLp4yMYUC1oTbpeFrxI=', '50787811', 'image/png', '2016-08-02 08:32:55', 1)